Tekla Open API Reference for Tekla Structures 2025
ClashCheckData Properties
The ClashCheckData type exposes the following members.
Properties
Name | Description
Object1
 Gets the first clashing object.
Object2
 Gets the second clashing object.
Overlap
 Gets the overlap of the clash. Only applies to clashes of type CLASH_TYPE_CLASH.
Type
 Gets the type of the clash.
Top
See Also
Reference
ClashCheckData Class
Tekla.Structures.Model Namespace